RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_usart.h
/* Bit fields for USART INPUT */
#define _USART_INPUT_RESETVALUE                 0x00000000UL                          /**< Default value for USART_INPUT */
#define _USART_INPUT_MASK                       0x00009F9FUL                          /**< Mask for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_SHIFT             0                                     /**< Shift value for USART_RXPRSSEL */
#define _USART_INPUT_RXPRSSEL_MASK              0x1FUL                                /**< Bit mask for USART_RXPRSSEL */
#define _USART_INPUT_RXPRSSEL_DEFAULT           0x00000000UL                          /**< Mode DEFAULT for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH0            0x00000000UL                          /**< Mode PRSCH0 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH1            0x00000001UL                          /**< Mode PRSCH1 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH2            0x00000002UL                          /**< Mode PRSCH2 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH3            0x00000003UL                          /**< Mode PRSCH3 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH4            0x00000004UL                          /**< Mode PRSCH4 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH5            0x00000005UL                          /**< Mode PRSCH5 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH6            0x00000006UL                          /**< Mode PRSCH6 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH7            0x00000007UL                          /**< Mode PRSCH7 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH8            0x00000008UL                          /**< Mode PRSCH8 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH9            0x00000009UL                          /**< Mode PRSCH9 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH10           0x0000000AUL                          /**< Mode PRSCH10 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH11           0x0000000BUL                          /**< Mode PRSCH11 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH12           0x0000000CUL                          /**< Mode PRSCH12 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH13           0x0000000DUL                          /**< Mode PRSCH13 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH14           0x0000000EUL                          /**< Mode PRSCH14 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH15           0x0000000FUL                          /**< Mode PRSCH15 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH16           0x00000010UL                          /**< Mode PRSCH16 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH17           0x00000011UL                          /**< Mode PRSCH17 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH18           0x00000012UL                          /**< Mode PRSCH18 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH19           0x00000013UL                          /**< Mode PRSCH19 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH20           0x00000014UL                          /**< Mode PRSCH20 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH21           0x00000015UL                          /**< Mode PRSCH21 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH22           0x00000016UL                          /**< Mode PRSCH22 for USART_INPUT */
#define _USART_INPUT_RXPRSSEL_PRSCH23           0x00000017UL                          /**< Mode PRSCH23 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_DEFAULT            (_USART_INPUT_RXPRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH0             (_USART_INPUT_RXPRSSEL_PRSCH0 << 0)   /**< Shifted mode PRSCH0 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH1             (_USART_INPUT_RXPRSSEL_PRSCH1 << 0)   /**< Shifted mode PRSCH1 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH2             (_USART_INPUT_RXPRSSEL_PRSCH2 << 0)   /**< Shifted mode PRSCH2 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH3             (_USART_INPUT_RXPRSSEL_PRSCH3 << 0)   /**< Shifted mode PRSCH3 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH4             (_USART_INPUT_RXPRSSEL_PRSCH4 << 0)   /**< Shifted mode PRSCH4 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH5             (_USART_INPUT_RXPRSSEL_PRSCH5 << 0)   /**< Shifted mode PRSCH5 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH6             (_USART_INPUT_RXPRSSEL_PRSCH6 << 0)   /**< Shifted mode PRSCH6 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH7             (_USART_INPUT_RXPRSSEL_PRSCH7 << 0)   /**< Shifted mode PRSCH7 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH8             (_USART_INPUT_RXPRSSEL_PRSCH8 << 0)   /**< Shifted mode PRSCH8 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH9             (_USART_INPUT_RXPRSSEL_PRSCH9 << 0)   /**< Shifted mode PRSCH9 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH10            (_USART_INPUT_RXPRSSEL_PRSCH10 << 0)  /**< Shifted mode PRSCH10 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH11            (_USART_INPUT_RXPRSSEL_PRSCH11 << 0)  /**< Shifted mode PRSCH11 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH12            (_USART_INPUT_RXPRSSEL_PRSCH12 << 0)  /**< Shifted mode PRSCH12 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH13            (_USART_INPUT_RXPRSSEL_PRSCH13 << 0)  /**< Shifted mode PRSCH13 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH14            (_USART_INPUT_RXPRSSEL_PRSCH14 << 0)  /**< Shifted mode PRSCH14 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH15            (_USART_INPUT_RXPRSSEL_PRSCH15 << 0)  /**< Shifted mode PRSCH15 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH16            (_USART_INPUT_RXPRSSEL_PRSCH16 << 0)  /**< Shifted mode PRSCH16 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH17            (_USART_INPUT_RXPRSSEL_PRSCH17 << 0)  /**< Shifted mode PRSCH17 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH18            (_USART_INPUT_RXPRSSEL_PRSCH18 << 0)  /**< Shifted mode PRSCH18 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH19            (_USART_INPUT_RXPRSSEL_PRSCH19 << 0)  /**< Shifted mode PRSCH19 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH20            (_USART_INPUT_RXPRSSEL_PRSCH20 << 0)  /**< Shifted mode PRSCH20 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH21            (_USART_INPUT_RXPRSSEL_PRSCH21 << 0)  /**< Shifted mode PRSCH21 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH22            (_USART_INPUT_RXPRSSEL_PRSCH22 << 0)  /**< Shifted mode PRSCH22 for USART_INPUT */
#define USART_INPUT_RXPRSSEL_PRSCH23            (_USART_INPUT_RXPRSSEL_PRSCH23 << 0)  /**< Shifted mode PRSCH23 for USART_INPUT */
#define USART_INPUT_RXPRS                       (0x1UL << 7)                          /**< PRS RX Enable */
#define _USART_INPUT_RXPRS_SHIFT                7                                     /**< Shift value for USART_RXPRS */
#define _USART_INPUT_RXPRS_MASK                 0x80UL                                /**< Bit mask for USART_RXPRS */
#define _USART_INPUT_RXPRS_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for USART_INPUT */
#define USART_INPUT_RXPRS_DEFAULT               (_USART_INPUT_RXPRS_DEFAULT << 7)     /**< Shifted mode DEFAULT for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_SHIFT            8                                     /**< Shift value for USART_CLKPRSSEL */
#define _USART_INPUT_CLKPRSSEL_MASK             0x1F00UL                              /**< Bit mask for USART_CLKPRSSEL */
#define _USART_INPUT_CLKPRSSEL_DEFAULT          0x00000000UL                          /**< Mode DEFAULT for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH0           0x00000000UL                          /**< Mode PRSCH0 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH1           0x00000001UL                          /**< Mode PRSCH1 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH2           0x00000002UL                          /**< Mode PRSCH2 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH3           0x00000003UL                          /**< Mode PRSCH3 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH4           0x00000004UL                          /**< Mode PRSCH4 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH5           0x00000005UL                          /**< Mode PRSCH5 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH6           0x00000006UL                          /**< Mode PRSCH6 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH7           0x00000007UL                          /**< Mode PRSCH7 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH8           0x00000008UL                          /**< Mode PRSCH8 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH9           0x00000009UL                          /**< Mode PRSCH9 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH10          0x0000000AUL                          /**< Mode PRSCH10 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH11          0x0000000BUL                          /**< Mode PRSCH11 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH12          0x0000000CUL                          /**< Mode PRSCH12 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH13          0x0000000DUL                          /**< Mode PRSCH13 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH14          0x0000000EUL                          /**< Mode PRSCH14 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH15          0x0000000FUL                          /**< Mode PRSCH15 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH16          0x00000010UL                          /**< Mode PRSCH16 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH17          0x00000011UL                          /**< Mode PRSCH17 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH18          0x00000012UL                          /**< Mode PRSCH18 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH19          0x00000013UL                          /**< Mode PRSCH19 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH20          0x00000014UL                          /**< Mode PRSCH20 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH21          0x00000015UL                          /**< Mode PRSCH21 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH22          0x00000016UL                          /**< Mode PRSCH22 for USART_INPUT */
#define _USART_INPUT_CLKPRSSEL_PRSCH23          0x00000017UL                          /**< Mode PRSCH23 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_DEFAULT           (_USART_INPUT_CLKPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH0            (_USART_INPUT_CLKPRSSEL_PRSCH0 << 8)  /**< Shifted mode PRSCH0 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH1            (_USART_INPUT_CLKPRSSEL_PRSCH1 << 8)  /**< Shifted mode PRSCH1 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH2            (_USART_INPUT_CLKPRSSEL_PRSCH2 << 8)  /**< Shifted mode PRSCH2 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH3            (_USART_INPUT_CLKPRSSEL_PRSCH3 << 8)  /**< Shifted mode PRSCH3 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH4            (_USART_INPUT_CLKPRSSEL_PRSCH4 << 8)  /**< Shifted mode PRSCH4 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH5            (_USART_INPUT_CLKPRSSEL_PRSCH5 << 8)  /**< Shifted mode PRSCH5 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH6            (_USART_INPUT_CLKPRSSEL_PRSCH6 << 8)  /**< Shifted mode PRSCH6 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH7            (_USART_INPUT_CLKPRSSEL_PRSCH7 << 8)  /**< Shifted mode PRSCH7 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH8            (_USART_INPUT_CLKPRSSEL_PRSCH8 << 8)  /**< Shifted mode PRSCH8 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH9            (_USART_INPUT_CLKPRSSEL_PRSCH9 << 8)  /**< Shifted mode PRSCH9 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH10           (_USART_INPUT_CLKPRSSEL_PRSCH10 << 8) /**< Shifted mode PRSCH10 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH11           (_USART_INPUT_CLKPRSSEL_PRSCH11 << 8) /**< Shifted mode PRSCH11 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH12           (_USART_INPUT_CLKPRSSEL_PRSCH12 << 8) /**< Shifted mode PRSCH12 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH13           (_USART_INPUT_CLKPRSSEL_PRSCH13 << 8) /**< Shifted mode PRSCH13 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH14           (_USART_INPUT_CLKPRSSEL_PRSCH14 << 8) /**< Shifted mode PRSCH14 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH15           (_USART_INPUT_CLKPRSSEL_PRSCH15 << 8) /**< Shifted mode PRSCH15 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH16           (_USART_INPUT_CLKPRSSEL_PRSCH16 << 8) /**< Shifted mode PRSCH16 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH17           (_USART_INPUT_CLKPRSSEL_PRSCH17 << 8) /**< Shifted mode PRSCH17 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH18           (_USART_INPUT_CLKPRSSEL_PRSCH18 << 8) /**< Shifted mode PRSCH18 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH19           (_USART_INPUT_CLKPRSSEL_PRSCH19 << 8) /**< Shifted mode PRSCH19 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH20           (_USART_INPUT_CLKPRSSEL_PRSCH20 << 8) /**< Shifted mode PRSCH20 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH21           (_USART_INPUT_CLKPRSSEL_PRSCH21 << 8) /**< Shifted mode PRSCH21 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH22           (_USART_INPUT_CLKPRSSEL_PRSCH22 << 8) /**< Shifted mode PRSCH22 for USART_INPUT */
#define USART_INPUT_CLKPRSSEL_PRSCH23           (_USART_INPUT_CLKPRSSEL_PRSCH23 << 8) /**< Shifted mode PRSCH23 for USART_INPUT */
#define USART_INPUT_CLKPRS                      (0x1UL << 15)                         /**< PRS CLK Enable */
#define _USART_INPUT_CLKPRS_SHIFT               15                                    /**< Shift value for USART_CLKPRS */
#define _USART_INPUT_CLKPRS_MASK                0x8000UL                              /**< Bit mask for USART_CLKPRS */
#define _USART_INPUT_CLKPRS_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for USART_INPUT */
#define USART_INPUT_CLKPRS_DEFAULT              (_USART_INPUT_CLKPRS_DEFAULT << 15)   /**< Shifted mode DEFAULT for USART_INPUT */

